---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateGutterError
source: html/fb63f7e3-b123-256a-41e9-8cb026d1faa6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateGutterError Property

Could not create Gutter. [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateGutterError { get; }
```